In [124]:
!conda info

     active environment : pandas_edu
    active env location : /home/behappyman/anaconda3/envs/pandas_edu
            shell level : 2
       user config file : /home/behappyman/.condarc
 populated config files :
          conda version : 23.7.4
    conda-build version : 3.26.1
         python version : 3.11.5.final.0
       virtual packages : __archspec=1=x86_64
                          __glibc=2.35=0
                          __linux=5.15.0=0
                          __unix=0=0
       base environment : /home/behappyman/anaconda3  (writable)
      conda av data dir : /home/behappyman/anaconda3/etc/conda
  conda av metadata url : None
           channel URLs : https://repo.anaconda.com/pkgs/main/linux-64
                          https://repo.anaconda.com/pkgs/main/noarch
                          https://repo.anaconda.com/pkgs/r/linux-64
                          https://repo.anaconda.com/pkgs/r/noarch
          package cache : /home/behappyman/anaconda3/pkgs
                          /home/behappyman/.conda/pkgs
       envs directories : /home/behappyman/anaconda3/envs
                          /home/behappyman/.conda/envs
               platform : linux-64
             user-agent : conda/23.7.4 requests/2.31.0 CPython/3.11.5 Linux/5.15.0-79-generic linuxmint/21.2 glibc/2.35 aau/0.4.2 c/gOjIcH-Rk4f-gHYMfQy9QA s/JmD5Ezlq-OYxa72Xz7_f_g e/mhF8q_V8lIIlbDODyTc72g
                UID:GID : 1000:1000
             netrc file : None
           offline mode : False

In [125]:
import pandas as pd
import numpy as np

# Pandas

## Series

### Созданиe

In [126]:
cities = ['Moscow', 'Saint-Petersburg', 'Penza']
area = [123, 100, 15]
cities_area_series = pd.Series(data=area, index=cities, name='cities_area')
cities_area_series

Moscow              123
Saint-Petersburg    100
Penza                15
Name: cities_area, dtype: int64

In [127]:
cars_price = {'geely': 2_000_000, 'haval': 2.5*1E6}
pd.Series(cars_price, name='cars_price')

geely    2000000.0
haval    2500000.0
Name: cars_price, dtype: float64

### Получение данных

In [128]:
print(cities_area_series['Moscow'], cities_area_series.iloc[0])

123 123

In [129]:
cities_area_series[cities_area_series >= 100]

Moscow              123
Saint-Petersburg    100
Name: cities_area, dtype: int64

### Изменение данных

In [130]:
cities_area_series['Moscow'] = 250
print(cities_area_series['Moscow'])

250

In [131]:
cities_area_series.index=['London', 'Paris', 'Amsterdam']
cities_area_series

London       250
Paris        100
Amsterdam     15
Name: cities_area, dtype: int64

In [132]:
def increase_by_two(x):
    return x + 2

cities_area_series = cities_area_series.apply(increase_by_two)
cities_area_series

London       252
Paris        102
Amsterdam     17
Name: cities_area, dtype: int64

## DataFrame

### Создание

In [133]:
people_info = [dict(age=25, height=180, weight=78), dict(age=35, height=190, weight=95)]
pd.DataFrame(people_info)

   age  height  weight
0   25     180      78
1   35     190      95

In [134]:
people_info = dict(Bob=dict(age=25, height=180, weight=78), Ann=dict(age=45, height=150, weight=99))
pd.DataFrame(people_info)

        Bob  Ann
age      25   45
height  180  150
weight   78   99

In [135]:
people_names = ['Bob', 'Ann', 'Max']
people_description = [dict(age=25, height=180, weight=78), 
                      dict(age=35, height=190, weight=95),
                      dict(age=7, height=120, weight=40)]

people = pd.DataFrame(data=people_description, index=people_names)

### Получение данных

In [136]:
people

     age  height  weight
Bob   25     180      78
Ann   35     190      95
Max    7     120      40

In [137]:
people.iloc[0:2]

     age  height  weight
Bob   25     180      78
Ann   35     190      95

In [138]:
people.loc['Bob':'Max']

     age  height  weight
Bob   25     180      78
Ann   35     190      95
Max    7     120      40

In [139]:
people.loc['Bob':'Ann', 'height':'weight']

     height  weight
Bob     180      78
Ann     190      95

In [140]:
people.loc[people['height'] > 130]

     age  height  weight
Bob   25     180      78
Ann   35     190      95

In [141]:
height_and_weight_verification = (people.height > 130) & (people.weight > 80)
people.loc[height_and_weight_verification]

     age  height  weight
Ann   35     190      95

### Изменение даннных

In [142]:
people.loc[height_and_weight_verification, 'weight'] = 150
people

     age  height  weight
Bob   25     180      78
Ann   35     190     150
Max    7     120      40

In [151]:
def add_two(x):
    return x + 2

def difference_between_avg(row):
    row.age -= avg_age
    row.height -= avg_height
    row.weight -= avg_weight
    return row

people['age'].apply(lambda x: x+2)
people['weight'].map(add_two)
avg_age = people.age.mean()
avg_height = people.height.mean()
avg_weight = people.weight.mean()

people_dif = pd.DataFrame(columns=['dif_age', 'dif_height', 'dif_weight'])

/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '2.666666666666668' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age
/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '12.666666666666668' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age
/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '-15.333333333333332' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age

In [152]:
people_dif[['dif_age', 'dif_height', 'dif_weight']] = people.apply(difference_between_avg, axis='columns')

/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '2.666666666666668' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age
/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '12.666666666666668' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age
/tmp/ipykernel_451505/1791569594.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '-15.333333333333332' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  row.age -= avg_age

In [153]:
people_dif

       dif_age  dif_height  dif_weight
Bob   2.666667   16.666667  -11.333333
Ann  12.666667   26.666667   60.666667
Max -15.333333  -43.333333  -49.333333

In [155]:
people_dif.applymap(lambda x: x + 100)

/tmp/ipykernel_451505/1463681103.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  people_dif.applymap(lambda x: x + 100)

        dif_age  dif_height  dif_weight
Bob  102.666667  116.666667   88.666667
Ann  112.666667  126.666667  160.666667
Max   84.666667   56.666667   50.666667

In [156]:
people

     age  height  weight
Bob   25     180      78
Ann   35     190     150
Max    7     120      40

### groupby

In [160]:
people.groupby('age').mean()

     height  weight
age
7     120.0    40.0
25    180.0    78.0
35    190.0   150.0

In [166]:
people.groupby('age')['height'].agg(['min', 'max'])

     min  max
age
7    120  120
25   180  180
35   190  190

In [168]:
people.groupby('age').agg({'height': 'max', 'weight': 'min'})

     height  weight
age
7       120      40
25      180      78
35      190     150

In [169]:
def square_calc(x):
    return x**2

people.groupby('age').agg(square_calc)

     height  weight
age
7     14400    1600
25    32400    6084
35    36100   22500